Repository: MuzaffarTursunov96/lms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Answered Questions
uz: Javob berilgan savollar

source: Current Question Index
uz: Joriy savol tartib raqami

source: About Us
uz: Biz haqimizda

source: Home
uz: Bosh sahifa

source: book library and store
uz: kitob kutubxonasi va do‘kon

source: Certain welcomed eveytry pain avoided but inger cer mstnces owing ation will online freetly.
uz: Ba’zi qabul qilingan holatlar og‘riqdan qochadi, lekin sharoit tufayli ta’minot onlayn tarzda bepul bo‘ladi.

source: learn courses online
uz: kurslarni onlayn o‘rganing

source: access 3000+ courses
uz: 3000+ kurslarga kirish

source: WELCOME TO GLOBAL EDUCATION
uz: GLOBAL TA’LIMGA XUSH KELIBSIZ

source: Call Anytime
uz: Istalgan vaqtda qo‘ng‘iroq qiling

source: Trusted by Students
uz: Talabalar ishonchi

source: Expert Instructor
uz: Mutaxassis o‘qituvchi

source: Get More Info
uz: Ko‘proq ma’lumot oling

source: IDEAL TUTOR EVERYONE
uz: HAR BIR KISHIGA IDEAL O‘QITUVCHI

source: Qualified Online Tutors
uz: Malakali onlayn o‘qituvchilar

source: course
uz: kurs

source: students
uz: talabalar

source: years experience
uz: yillik tajriba

source: Find Our Teachers
uz: O‘qituvchilarimizni toping

source: ASKED QUESTIONS
uz: BERILGAN SAVOLLAR

source: Academic Faq's
uz: Akademik savol-javoblar

source: Apply Today
uz: Bugun ariza topshiring

source: Admission Process
uz: Qabul jarayoni

source: LOG IN
uz: KIRISH

source: Username or email address
uz: Foydalanuvchi nomi yoki elektron pochta manzili

source: Password
uz: Parol

source: Remember me
uz: Eslab qolish

source: REGISTER
uz: RO‘YXATDAN O‘TISH

source: Login
uz: Kirish

source: SIGN UP
uz: RO‘YXATDAN O‘TISH

source: First Name
uz: Ism

source: SIGN IN
uz: KIRISH

source: Register
uz: Ro‘yxatdan o‘tish

source: ROA Group - online education platform
uz: ROA Group - onlayn ta’lim platformasi

source: Cancel Preloader
uz: Yuklashni bekor qilish

source: My Courses
uz: Mening kurslarim

source: All Courses
uz: Barcha kurslar

source: Our Tutors
uz: Bizning o‘qituvchilarimiz

source: Become Tutor
uz: O‘qituvchi bo‘lish

source: Contact Us
uz: Bog‘lanish

source: Uzbek
uz: O‘zbek

source: Русский
uz: Ruscha

source: English
uz: Inglizcha

source: What are you looking for
uz: Nimani qidiryapsiz

source: BECOME AN ONLINE TUTOR
uz: ONLAYN O‘QITUVCHI BO‘LING

source: Give lessons whenever and wherever you want. We take care of the rest.
uz: Istalgan joyda va istalgan vaqtda dars o‘ting. Qolganini biz hal qilamiz.

source: Register Now
uz: Hozir ro‘yxatdan o‘ting

source: MORE THAN JUST A TUTORING
uz: FAQATGINA O‘QITUVCHILIKDAN KO‘PROQ

source: Why become an online tutor
uz: Nega onlayn o‘qituvchi bo‘lish kerak

source: You Need to Teach Online.
uz: Siz onlayn dars berishingiz kerak.

source: Ducamb welcomed every pain avoided but in certa mstances owing to the claims of igation that off bu will frequently occuthe obligations of business it will ently ofcurs that pleasures.
uz: Ducamb barcha og‘riqlardan qochgan, lekin ba’zi sharoitlarda majburiyatlar va ish talablari tufayli bu tez-tez uchraydi va ba’zan lazzatlarni cheklaydi.

source: IDEAL TUTOR FOR EVERYONE
uz: HAR KIM UCHUN IDEAL O‘QITUVCHI

source: The benefits of giving classes online
uz: Onlayn dars berishning afzalliklari

source: Call us now and transform your career today
uz: Bizga hozir qo‘ng‘iroq qiling va karyerangizni bugun o‘zgartiring

source: FIND THE BEST TEACHER FOR YOU
uz: SIZ UCHUN ENG YAXSHI O‘QITUVCHINI TOPING

source: How it works
uz: Bu qanday ishlaydi

source: PLEASURES HAVE TO REPUDIATED
uz: BA’ZI LAZZATLARDAN VOZ KECHISH KERAK

source: Top Companies
uz: Eng yaxshi kompaniyalar

source: Blog Details
uz: Blog tafsilotlari

source: Contac Us
uz: Biz bilan bog‘laning

source: Get in Touch
uz: Aloqaga chiqing

source: become a partner school, or discover more about our work.
uz: hamkor maktabga aylaning yoki bizning ishimiz haqida ko‘proq bilib oling.

source: Regional Office
uz: Hududiy ofis

source: Office hours are 9am – 5pm
uz: Ish vaqti 9:00 – 17:00

source: Monday-Thursday and 9am – 4.30pm on Friday.
uz: Dushanba – Payshanba, Juma kuni 9:00 – 16:30.

source: any questions?
uz: savollaringiz bormi?

source: Your Name
uz: Ismingiz

source: Email Address
uz: Elektron pochta manzili

source: Phone No
uz: Telefon raqami

source: Select Subject
uz: Mavzuni tanlang

source: Private Tutor
uz: Shaxsiy o‘qituvchi

source: Admission Session
uz: Qabul sessiyasi

source: Write your message
uz: Xabaringizni yozing

source: send message
uz: xabar yuborish

source: For message will display here
uz: Xabar shu yerda ko‘rsatiladi

source: Course Details
uz: Kurs tafsilotlari

source: Our Courses
uz: Bizning kurslarimiz

source: Browse Top Courses
uz: Eng yaxshi kurslarni ko‘rib chiqing

source: Most Popular Courses
uz: Eng mashhur kurslar

source: No Courses Found
uz: Hech qanday kurs topilmadi

source: Q&A
uz: Savol-javob

source: Notes
uz: Eslatmalar

source: Course Overview
uz: Kurs haqida umumiy ma’lumot

source: Instructor
uz: O‘qituvchi

source: Language
uz: Til

source: Questions & Answers
uz: Savollar va javoblar

source: Here you can ask and answer questions about this course.
uz: Bu yerda siz kurs haqida savollar berishingiz va javob yozishingiz mumkin.

source: Your Notes
uz: Sizning eslatmalaringiz

source: Save Note
uz: Eslatmani saqlash

source: Unknown item type
uz: Noma’lum element turi

source: Content not found for item order
uz: Element tartibi uchun kontent topilmadi

source: No items in this section.
uz: Bu bo‘limda elementlar yo‘q.

source: Students
uz: Talabalar

source: Sections
uz: Bo‘limlar

source: PAID
uz: TO‘LANADI

source: Go to the Course
uz: Kursga o‘tish

source: No articles found.
uz: Maqolalar topilmadi.

source: Previous
uz: Oldingi

source: Next
uz: Keyingi

source: Все вопросы
uz: Barcha savollar

source: Вопрос
uz: Savol

source: Loading quiz data...
uz: Test ma’lumotlari yuklanmoqda...

source: Quiz completed! You have answered all the questions.
uz: Test tugadi! Siz barcha savollarga javob berdingiz.

source: Failed to load quiz. Please try again later.
uz: Testni yuklab bo‘lmadi. Iltimos, keyinroq qayta urinib ko‘ring.

source: Quiz is complete or no more questions available.
uz: Test tugagan yoki boshqa savollar yo‘q.

source: Single-Choice (Radio)
uz: Yagona tanlov (radio tugma)

source: Failed to save answer. Please check your connection.
uz: Javobni saqlab bo‘lmadi. Iltimos, internet ulanishingizni tekshiring.

source: All questions
uz: Barcha savollar

source: Off
uz: O‘chirilgan

source: Preview Course
uz: Kursni ko‘rib chiqish

source: Event Details
uz: Tadbir tafsilotlari

source: Find Programs
uz: Dasturlarni toping

source: Search Your Program
uz: Dasturingizni qidiring

source: Undergraduate Programs
uz: Bakalavriat dasturlari

source: Graduate Programs
uz: Magistratura dasturlari

source: 8,000 online courses
uz: 8 000 ta onlayn kurs

source: Explore a variety of fresh topics
uz: Turli yangi mavzularni o‘rganing

source: Expert Instruction
uz: Mutaxassis ko‘rsatmalari

source: Find the right instructor for you
uz: Siz uchun mos o‘qituvchini toping

source: PROGRAMS (INCLUDING MAJORS AND MINORS)
uz: DASTURLAR (ASOSIY VA QO‘SHIMCHA YO‘NALISHLAR BILAN)

source: TYPE OF DEGREE
uz: DARAZA TURI

source: AWARD WINNING QUALIFIED TUTORS
uz: MUKOFOTLI MALAKALI O‘QITUVCHILAR

source: Find a Tutor
uz: O‘qituvchi toping

source: FREQUENTLY ASKED QUESTIONS
uz: KO‘P SO‘RALADIGAN SAVOLLAR

source: Lorem ipsum dolor sit amet, consectet rem ips dolor sit amet. sum dolor sit amet, consectet e dolor sit amet, comod.
uz: Lorem ipsum matni: mazmuni yo‘q to‘ldiruvchi matn.

source: Study Links
uz: O‘quv havolalari

source: Summer Sessions
uz: Yozgi sessiyalar

source: Best Courses
uz: Eng yaxshi kurslar

source: Hire teachers
uz: O‘qituvchilarni yollash

source: Program FAQs
uz: Dastur bo‘yicha savol-javoblar

source: Quick Links
uz: Tezkor havolalar

source: Community
uz: Hamjamiyat

source: Support
uz: Qo‘llab-quvvatlash

source: Video Guides
uz: Video qo‘llanmalar

source: Documentation
uz: Hujjatlar

source: Security
uz: Xavfsizlik

source: Recent Courses
uz: Yangi kurslar

source: Phone
uz: Telefon

source: Email
uz: Elektron pochta

source: Log out
uz: Chiqish

source: Login & Register
uz: Kirish va Ro‘yxatdan o‘tish

source: Find Program
uz: Dastur topish

source: Find your course...
uz: Kursingizni toping...

source: Find Course
uz: Kursni topish

source: our Top Categories
uz: Bizning asosiy toifalar

source: Browse Learn Skills You Need
uz: Sizga kerakli ko‘nikmalarni o‘rganing

source: web Developer
uz: Veb-dasturchi

source: Basic English
uz: Boshlang‘ich ingliz tili

source: tach & coding
uz: Texnologiya va kodlash

source: IT Service
uz: IT xizmati

source: GLOBAL EDUCATION
uz: GLOBAL TA’LIM

source: Browse Top Courses​
uz: Eng yaxshi kurslarni ko‘rib chiqing

source: PRICING PLANS
uz: NARXLAR REJALARI

source: Lesson Packages
uz: Dars paketlari

source: Standard
uz: Standart

source: month
uz: oy

source: Secondary Education
uz: O‘rta ta’lim

source: lessons / month
uz: dars / oy

source: One-to-one training
uz: Yakka tartibdagi mashg‘ulot

source: minutes
uz: daqiqa

source: Lesson price
uz: Dars narxi

source: Save
uz: Saqlash

source: Discount
uz: Chegirma

source: Purchase Now
uz: Hozir xarid qiling

source: year
uz: yil

source: BLOG AND UPDATES
uz: BLOG VA YANGILIKLAR

source: News & Articles
uz: Yangiliklar va maqolalar

source: Read More
uz: Batafsil o‘qish

source: Program Details
uz: Dastur tafsilotlari

source: CERTIFICATE
uz: SERTIFIKAT

source: Guaranteed 40%% tuition scholarships
uz: 40%% ta’lim grantlari kafolatlanadi

source: Core Courses
uz: Asosiy kurslar

source: Additional Courses
uz: Qo‘shimcha kurslar

source: Program Features
uz: Dastur xususiyatlari

source: Requirements
uz: Talablar

source: Internships
uz: Amaliyotlar

source: Quiz Results
uz: Test natijalari

source: Correct Answers
uz: To‘g‘ri javoblar

source: Date
uz: Sana

source: Review Your Answers
uz: Javoblaringizni ko‘rib chiqing

source: Correct
uz: To‘g‘ri

source: Your Answer
uz: Sizning javobingiz

source: Correct Answer
uz: To‘g‘ri javob

source: Your Attempts
uz: Sizning urinishlaringiz

source: Attempt
uz: Urinish

source: Retake Quiz
uz: Testni qayta topshirish

source: Back to Quiz
uz: Testga qaytish

source: Loading
uz: Yuklanmoqda

source: Loading questions...
uz: Savollar yuklanmoqda...

source: Submit
uz: Yuborish

source: Attempts used
uz: Urinishlar ishlatilgan

source: Start Test
uz: Testni boshlash

source: Show Results
uz: Natijalarni ko‘rsatish

source: You have reached the maximum number of attempts.
uz: Siz urinishlar sonining maksimal chegarasiga yetdingiz.

source: Tutor Details
uz: O‘qituvchi tafsilotlari

source: per hour
uz: soatiga

source: History Tutor
uz: Tarix o‘qituvchisi

source: Explore Courses
uz: Kurslarni ko‘rib chiqing

source: OUR TUTORS ARE PASSIONATE
uz: BIZNING O‘QITUVCHILARIMIZ SADOQATLI

source: Start your education career with us
uz: Ta’limiy faoliyatingizni biz bilan boshlang

source: Hand-picked authors
uz: Tanlab olingan mualliflar

source: Easy to follow curriculum
uz: Oson kuzatiladigan o‘quv dasturi

source: Free courses
uz: Bepul kurslar

source: Money-back guarantee
uz: Pulni qaytarish kafolati

source: Tutors not found.
uz: O‘qituvchilar topilmadi.

source: WHAT PEOPLE SAY
uz: ODAMLAR NIMA DEYDI

source: Our Students Words
uz: Talabalarimizning fikrlari
