Repository: MuzaffarTursunov96/lms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Admin
uz: Administrator

source: Editor
uz: Tahrirchi

source: Viewer
uz: Ko‘ruvchi

source: User
uz: Foydalanuvchi

source: Messages
uz: Xabarlar

source: Site Maps
uz: Sayt xaritalari

source: Static Files
uz: Statik fayllar

source: Syndication
uz: Sindikatsiya

source: That page number is not an integer
uz: Bu sahifa raqami butun son emas

source: That page number is less than 1
uz: Bu sahifa raqami 1 dan kichik

source: That page contains no results
uz: Bu sahifada natijalar yo‘q

source: Enter a valid value.
uz: To‘g‘ri qiymat kiriting.

source: Enter a valid domain name.
uz: To‘g‘ri domen nomini kiriting.

source: Enter a valid URL.
uz: To‘g‘ri URL kiriting.

source: Enter a valid integer.
uz: To‘g‘ri butun son kiriting.

source: Enter a valid email address.
uz: To‘g‘ri email manzilini kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
uz: Harf, raqam, pastki chiziq yoki defisdan iborat to‘g‘ri “slug” kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
uz: Unicode harflari, raqamlar, pastki chiziq yoki defisdan iborat to‘g‘ri “slug” kiriting.

source: Enter a valid %(protocol)s address.
uz: To‘g‘ri %(protocol)s manzilini kiriting.

source: IPv4 or IPv6
uz: IPv4 yoki IPv6

source: Enter only digits separated by commas.
uz: Faqat vergul bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
uz: Bu qiymat %(limit_value)s bo‘lishiga ishonch hosil qiling (hozirgi qiymat: %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan kichik yoki teng bo‘lishiga ishonch hosil qiling.

source: Ensure this value is greater than or equal to %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan katta yoki teng bo‘lishiga ishonch hosil qiling.

source: Ensure this value is a multiple of step size %(limit_value)s.
uz: Bu qiymat %(limit_value)s qadam o‘lchamiga karrali ekanligiga ishonch hosil qiling.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
uz: Bu qiymat %(offset)s dan boshlab %(limit_value)s qadam o‘lchamiga karrali ekanligiga ishonch hosil qiling, masalan: %(offset)s, %(valid_value1)s, %(valid_value2)s va hokazo.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
uz: Bu qiymat kamida %(limit_value)d ta belgidan iborat ekanligiga ishonch hosil qiling (hozirgi: %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
uz: Bu qiymat ko‘pi bilan %(limit_value)d ta belgidan oshmasligiga ishonch hosil qiling (hozirgi: %(show_value)d).

source: Enter a number.
uz: Raqam kiriting.

source: Ensure that there are no more than %(max)s digit in total.
uz: Umumiy raqamlar soni %(max)s tadan oshmasligiga ishonch hosil qiling.

source: Ensure that there are no more than %(max)s decimal place.
uz: Kasr qismi %(max)s belgidan oshmasligiga ishonch hosil qiling.

source: Ensure that there are no more than %(max)s digit before the decimal point.
uz: Kasrdan oldingi raqamlar %(max)s tadan oshmasligiga ishonch hosil qiling.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
uz: “%(extension)s” kengaytmali faylga ruxsat berilmagan. Ruxsat etilgan kengaytmalar: %(allowed_extensions)s.

source: Null characters are not allowed.
uz: Bo‘sh (null) belgilar kiritishga ruxsat berilmaydi.

source: and
uz: va

source: %(model_name)s with this %(field_labels)s already exists.
uz: %(model_name)s shu %(field_labels)s bilan allaqachon mavjud.

source: Constraint “%(name)s” is violated.
uz: “%(name)s” cheklovi buzildi.

source: Value %(value)r is not a valid choice.
uz: Qiymat %(value)r to‘g‘ri tanlov emas.

source: This field cannot be null.
uz: Bu maydon bo‘sh (null) bo‘lishi mumkin emas.

source: This field cannot be blank.
uz: Bu maydon bo‘sh qoldirilishi mumkin emas.

source: %(model_name)s with this %(field_label)s already exists.
uz: %(model_name)s shu %(field_label)s bilan allaqachon mavjud.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
uz: %(field_label)s %(date_field_label)s %(lookup_type)s uchun yagona bo‘lishi kerak.

source: Field of type: %(field_type)s
uz: Maydon turi: %(field_type)s

source: “%(value)s” value must be either True or False.
uz: “%(value)s” qiymati True yoki False bo‘lishi kerak.

source: “%(value)s” value must be either True, False, or None.
uz: “%(value)s” qiymati True, False yoki None bo‘lishi kerak.

source: Boolean (Either True or False)
uz: Mantiqiy qiymat (True yoki False)

source: String (up to %(max_length)s)
uz: Matn (uzunligi %(max_length)s belgigacha)

source: String (unlimited)
uz: Matn (cheklanmagan)

source: Comma-separated integers
uz: Vergul bilan ajratilgan butun sonlar

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
uz: “%(value)s” noto‘g‘ri sana formatida. YYYY-MM-DD formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
uz: “%(value)s” YYYY-MM-DD formatida, lekin yaroqsiz sana.

source: Date (without time)
uz: Sana (vaqtsiz)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
uz: “%(value)s” noto‘g‘ri formatda. YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
uz: “%(value)s” YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] formatida, lekin noto‘g‘ri sana/vaqt.

source: Date (with time)
uz: Sana (vaqt bilan)

source: “%(value)s” value must be a decimal number.
uz: “%(value)s” qiymati o‘nlik son bo‘lishi kerak.

source: Decimal number
uz: O‘nlik son

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
uz: “%(value)s” noto‘g‘ri formatda. [DD] [[HH:]MM:]ss[.uuuuuu] formatida bo‘lishi kerak.

source: Duration
uz: Davomiylik

source: Email address
uz: Elektron pochta manzili

source: File path
uz: Fayl yo‘li

source: “%(value)s” value must be a float.
uz: “%(value)s” qiymati o‘nlik son (float) bo‘lishi kerak.

source: Floating point number
uz: O‘nlik nuqtali son

source: “%(value)s” value must be an integer.
uz: “%(value)s” qiymati butun son bo‘lishi kerak.

source: Integer
uz: Butun son

source: Big (8 byte) integer
uz: Katta (8 baytli) butun son

source: Small integer
uz: Kichik butun son

source: IPv4 address
uz: IPv4 manzili

source: IP address
uz: IP manzil

source: “%(value)s” value must be either None, True or False.
uz: “%(value)s” qiymati None, True yoki False bo‘lishi kerak.

source: Boolean (Either True, False or None)
uz: Mantiqiy qiymat (True, False yoki None)

source: Positive big integer
uz: Musbat katta butun son

source: Positive small integer
uz: Musbat kichik butun son

source: Slug (up to %(max_length)s)
uz: Slug (uzunligi %(max_length)s gacha)

source: Text
uz: Matn

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
uz: “%(value)s” noto‘g‘ri formatda. HH:MM[:ss[.uuuuuu]] formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
uz: “%(value)s” HH:MM[:ss[.uuuuuu]] formatida, lekin noto‘g‘ri vaqt.

source: Time
uz: Vaqt

source: Raw binary data
uz: Ikkilik (binary) xom ma’lumotlar

source: “%(value)s” is not a valid UUID.
uz: “%(value)s” to‘g‘ri UUID emas.

source: Universally unique identifier
uz: Umumiy yagona identifikator (UUID)

source: File
uz: Fayl

source: Image
uz: Rasm

source: A JSON object
uz: JSON obyekti

source: Value must be valid JSON.
uz: Qiymat yaroqli JSON bo‘lishi kerak.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
uz: %(model)s obyekti %(field)s %(value)r bilan to‘g‘ri tanlov emas.

source: Foreign Key (type determined by related field)
uz: Tashqi kalit (tur bog‘langan maydon orqali aniqlanadi)

source: One-to-one relationship
uz: Birga-bir munosabat

source: %(from)s-%(to)s relationship
uz: %(from)s-%(to)s munosabati

source: %(from)s-%(to)s relationships
uz: %(from)s-%(to)s munosabatlari

source: Many-to-many relationship
uz: Ko‘pdan-ko‘p munosabat

source: This field is required.
uz: Bu maydon majburiy.

source: Enter a whole number.
uz: Butun son kiriting.

source: Enter a valid date.
uz: To‘g‘ri sana kiriting.

source: Enter a valid time.
uz: To‘g‘ri vaqt kiriting.

source: Enter a valid date/time.
uz: To‘g‘ri sana/vaqt kiriting.

source: Enter a valid duration.
uz: To‘g‘ri davomiylik kiriting.

source: The number of days must be between {min_days} and {max_days}.
uz: Kunlar soni {min_days} va {max_days} oralig‘ida bo‘lishi kerak.

source: No file was submitted. Check the encoding type on the form.
uz: Hech qanday fayl yuborilmadi. Formadagi kodlash turini tekshiring.

source: No file was submitted.
uz: Hech qanday fayl yuborilmadi.

source: The submitted file is empty.
uz: Yuborilgan fayl bo‘sh.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
uz: Fayl nomi uzunligi ko‘pi bilan %(max)d ta belgi bo‘lishiga ishonch hosil qiling (hozirgi: %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
uz: Iltimos, yoki fayl yuboring yoki tozalash katakchasini belgilang, ikkalasini emas.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
uz: To‘g‘ri rasm yuklang. Siz yuborgan fayl rasm emas yoki buzilgan rasm.

source: Select a valid choice. %(value)s is not one of the available choices.
uz: To‘g‘ri tanlovni belgilang. %(value)s mavjud variantlardan biri emas.

source: Enter a list of values.
uz: Qiymatlar ro‘yxatini kiriting.

source: Enter a complete value.
uz: To‘liq qiymat kiriting.

source: Enter a valid UUID.
uz: To‘g‘ri UUID kiriting.

source: Enter a valid JSON.
uz: To‘g‘ri JSON kiriting.

source: (Hidden field %(name)s) %(error)s
uz: (Yashirin maydon %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
uz: ManagementForm ma’lumotlari yetishmaydi yoki o‘zgartirilgan. Yetishmayotgan maydonlar: %(field_names)s. Muammo davom etsa, xato haqida xabar berishingiz mumkin.

source: Please submit at most %(num)d form.
uz: Iltimos, ko‘pi bilan %(num)d ta forma yuboring.

source: Please submit at least %(num)d form.
uz: Iltimos, kamida %(num)d ta forma yuboring.

source: Order
uz: Tartib

source: Delete
uz: O‘chirish

source: Please correct the duplicate data for %(field)s.
uz: Iltimos, %(field)s uchun takroriy ma’lumotlarni to‘g‘rilang.

source: Please correct the duplicate data for %(field)s, which must be unique.
uz: Iltimos, yagona bo‘lishi kerak bo‘lgan %(field)s uchun takroriy ma’lumotlarni to‘g‘rilang.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
uz: Iltimos, %(date_field)s ichidagi %(lookup)s uchun yagona bo‘lishi kerak bo‘lgan %(field_name)s ma’lumotlarini to‘g‘rilang.

source: Please correct the duplicate values below.
uz: Iltimos, quyidagi takroriy qiymatlarni to‘g‘rilang.

source: The inline value did not match the parent instance.
uz: Ichki qiymat asosiy obyektga mos kelmadi.

source: Select a valid choice. That choice is not one of the available choices.
uz: To‘g‘ri tanlovni belgilang. Bu tanlov mavjud variantlardan biri emas.

source: “%(pk)s” is not a valid value.
uz: “%(pk)s” to‘g‘ri qiymat emas.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
uz: %(datetime)s vaqt zonasi %(current_timezone)s ichida talqin qilinmadi; u noaniq yoki mavjud emas bo‘lishi mumkin.

source: Clear
uz: Tozalash

source: Currently
uz: Hozirgi

source: Change
uz: O‘zgartirish

source: Unknown
uz: Noma’lum

source: Yes
uz: Ha

source: No
uz: Yo‘q

source: yes,no,maybe
uz: ha,yo‘q,balki

source: %(size)d byte
uz: %(size)d bayt

source: p.m.
uz: kechqurun

source: a.m.
uz: ertalab

source: PM
uz: KE

source: AM
uz: ER

source: midnight
uz: yarim tun

source: noon
uz: peshin

source: Monday
uz: Dushanba

source: Tuesday
uz: Seshanba

source: Wednesday
uz: Chorshanba

source: Thursday
uz: Payshanba

source: Friday
uz: Juma

source: Saturday
uz: Shanba

source: Sunday
uz: Yakshanba

source: Mon
uz: Du

source: Tue
uz: Se

source: Wed
uz: Chor

source: Thu
uz: Pay

source: Fri
uz: Ju

source: Sat
uz: Sha

source: Sun
uz: Yak

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: Mart

source: April
uz: Aprel

source: June
uz: Iyun

source: July
uz: Iyul

source: August
uz: Avgust

source: September
uz: Sentabr

source: October
uz: Oktabr

source: November
uz: Noyabr

source: December
uz: Dekabr

source: jan
uz: yan

source: feb
uz: fev

source: jun
uz: iyun

source: jul
uz: iyul

source: aug
uz: avg

source: sep
uz: sen

source: oct
uz: okt

source: nov
uz: noy

source: dec
uz: dek

# abbrev. month
source: Jan.
uz: Yan.

# abbrev. month
source: Feb.
uz: Fev.

# abbrev. month
source: March
uz: Mart

# abbrev. month
source: April
uz: Apr.

# abbrev. month
source: June
uz: Iyun

# abbrev. month
source: July
uz: Iyul

# abbrev. month
source: Aug.
uz: Avg.

# abbrev. month
source: Sept.
uz: Sen.

# abbrev. month
source: Oct.
uz: Okt.

# abbrev. month
source: Nov.
uz: Noy.

# abbrev. month
source: Dec.
uz: Dek.

# alt. month
source: January
uz: Yanvar

# alt. month
source: February
uz: Fevral

# alt. month
source: March
uz: Mart

# alt. month
source: April
uz: Aprel

# alt. month
source: June
uz: Iyun

# alt. month
source: July
uz: Iyul

# alt. month
source: August
uz: Avgust

# alt. month
source: September
uz: Sentabr

# alt. month
source: October
uz: Oktabr

# alt. month
source: November
uz: Noyabr

# alt. month
source: December
uz: Dekabr

source: This is not a valid IPv6 address.
uz: Bu to‘g‘ri IPv6 manzili emas.

source: or
uz: yoki

source: %(num)d year
uz: %(num)d yil

source: %(num)d month
uz: %(num)d oy

source: %(num)d week
uz: %(num)d hafta

source: %(num)d day
uz: %(num)d kun

source: %(num)d hour
uz: %(num)d soat

source: %(num)d minute
uz: %(num)d daqiqa

source: Forbidden
uz: Taqiqlangan

source: CSRF verification failed. Request aborted.
uz: CSRF tekshiruvi muvaffaqiyatsiz tugadi. So‘rov bekor qilindi.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Siz bu xabarni ko‘ryapsiz, chunki ushbu HTTPS sayt brauzeringizdan “Referer header” yuborilishini talab qiladi, lekin u yuborilmadi. Bu sarlavha xavfsizlik uchun talab qilinadi, uchinchi tomon brauzeringizni nazorat qilmayotganiga ishonch hosil qilish uchun.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
uz: Agar brauzeringizda “Referer” sarlavhalari o‘chirilgan bo‘lsa, iltimos ularni qayta yoqing, hech bo‘lmaganda ushbu sayt uchun, yoki HTTPS ulanishlar uchun, yoki “same-origin” so‘rovlari uchun.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
uz: Agar siz <meta name="referrer" content="no-referrer"> tegi yoki “Referrer-Policy: no-referrer” sarlavhasidan foydalanayotgan bo‘lsangiz, iltimos ularni olib tashlang. CSRF himoyasi qat’iy referer tekshiruvini o‘tkazish uchun “Referer” sarlavhasini talab qiladi. Agar maxfiylik haqida xavotirga tushsangiz, uchinchi tomon saytlariga havolalar uchun <a rel="noreferrer" …> kabi alternativalardan foydalaning.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Siz bu xabarni ko‘ryapsiz, chunki ushbu sayt forma yuborishda CSRF cookie talab qiladi. Bu cookie xavfsizlik uchun zarur, brauzeringiz uchinchi tomon tomonidan nazorat qilinmayotganiga ishonch hosil qilish uchun.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
uz: Agar brauzeringizda cookie’lar o‘chirib qo‘yilgan bo‘lsa, iltimos ularni qayta yoqing, hech bo‘lmaganda ushbu sayt uchun yoki “same-origin” so‘rovlari uchun.

source: More information is available with DEBUG=True.
uz: Qo‘shimcha ma’lumot olish uchun DEBUG=True holatini yoqing.

source: No year specified
uz: Yil ko‘rsatilmagan

source: Date out of range
uz: Sana diapazondan tashqarida

source: No month specified
uz: Oy ko‘rsatilmagan

source: No day specified
uz: Kun ko‘rsatilmagan

source: No week specified
uz: Hafta ko‘rsatilmagan

source: No %(verbose_name_plural)s available
uz: %(verbose_name_plural)s mavjud emas

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
uz: Kelajakdagi %(verbose_name_plural)s mavjud emas, chunki %(class_name)s.allow_future = False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
uz: “%(datestr)s” noto‘g‘ri sana, berilgan format: “%(format)s”

source: No %(verbose_name)s found matching the query
uz: So‘rov bo‘yicha mos %(verbose_name)s topilmadi

source: Page is not “last”, nor can it be converted to an int.
uz: Sahifa “last” emas, va uni butun songa aylantirib bo‘lmaydi.

source: Invalid page (%(page_number)s): %(message)s
uz: Noto‘g‘ri sahifa (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
uz: Ro‘yxat bo‘sh va “%(class_name)s.allow_empty = False”.

source: Directory indexes are not allowed here.
uz: Bu yerda papka indekslariga ruxsat berilmaydi.

source: “%(path)s” does not exist
uz: “%(path)s” mavjud emas

source: Index of %(directory)s
uz: %(directory)s indeksi

source: The install worked successfully! Congratulations!
uz: O‘rnatish muvaffaqiyatli yakunlandi! Tabriklaymiz!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
uz: Django %(version)s uchun <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">chiqarilish qaydlari</a>ni ko‘ring

source: Django Documentation
uz: Django hujjatlari

source: Topics, references, &amp; how-to’s
uz: Mavzular, qo‘llanmalar va yo‘riqnomalar

source: Tutorial: A Polling App
uz: Qo‘llanma: So‘rovnoma ilovasi

source: Get started with Django
uz: Django bilan boshlash

source: Django Community
uz: Django hamjamiyati

source: Connect, get help, or contribute
uz: Ulaning, yordam oling yoki hissa qo‘shing

source: title
uz: sarlavha

source: password
uz: parol

source: title a
uz: sarlavha a

source: title b
uz: sarlavha b

source: title c
uz: sarlavha c

source: title d
uz: sarlavha d

source: visits
uz: tashriflar

source: Sorry, translation is not available.
uz: Kechirasiz, tarjima mavjud emas.

source: None
uz: Yo‘q

source: Add another %(verbose_name)s
uz: Yana bir %(verbose_name)s qo‘shish

source: Remove
uz: O‘chirish

source: Move Item
uz: Elementni ko‘chirish

source: Delete Item
uz: Elementni o‘chirish

source: Open All Items
uz: Barcha elementlarni ochish

source: Close All Items
uz: Barcha elementlarni yopish

source: Add Item
uz: Element qo‘shish

source: View on site
uz: Saytda ko‘rish

source: Add Another
uz: Yana qo‘shish

source: View
uz: Ko‘rish

source: Delete?
uz: O‘chirish?

source: Course Sections
uz: Kurs bo‘limlari

source: Lecture
uz: Ma’ruza

source: Lectures
uz: Ma’ruzalar

source: Choice
uz: Tanlov

source: Choices
uz: Tanlovlar

source: Question
uz: Savol

source: Questions
uz: Savollar

source: Review
uz: Sharh

source: Reviews
uz: Sharhlar

source: Quiz
uz: Test

source: Quizzes
uz: Testlar

source: Course
uz: Kurs

source: Courses
uz: Kurslar

source: Article
uz: Maqola

source: Articles
uz: Maqolalar

source: Blogs
uz: Bloglar

source: Blog Type
uz: Blog turi

source: Blog Types
uz: Blog turlari

source: Page Type
uz: Sahifa turi

source: Page Types
uz: Sahifa turlari

source: Qualification
uz: Malaka

source: Qualifications
uz: Malakalar

source: Tutor
uz: O‘qituvchi

source: Tutors
uz: O‘qituvchilar

source: Learning Management System
uz: O‘quv boshqaruv tizimi

source: Title
uz: Sarlavha

source: Description
uz: Tavsif

source: Helper Text 1
uz: Yordamchi matn 1

source: Helper Text 2
uz: Yordamchi matn 2

source: Helper Text 3
uz: Yordamchi matn 3

source: Helper Text 4
uz: Yordamchi matn 4

source: Helper Text 5
uz: Yordamchi matn 5

source: Created At
uz: Yaratilgan sana

source: Vimeo URL
uz: Vimeo havolasi

source: Category
uz: Kategoriya

source: Start Date
uz: Boshlanish sanasi

source: Start Hour
uz: Boshlanish vaqti

source: End Hour
uz: Tugash vaqti

source: Topic
uz: Mavzu

source: Cost
uz: Narxi

source: Organiser Full Name
uz: Tashkilotchining to‘liq ismi

source: Organiser Email
uz: Tashkilotchining elektron pochtasi

source: Organiser Phone
uz: Tashkilotchining telefoni

source: Name
uz: Ism

source: Subject
uz: Fan

source: Hourly Rate
uz: Soatbay to‘lov

source: Experience (Years)
uz: Tajriba (yillar)

source: Lessons Completed
uz: Tugallangan darslar

source: Rating
uz: Reyting

source: Profile Image
uz: Profil rasmi

source: Facebook URL
uz: Facebook havolasi

source: Twitter URL
uz: Twitter havolasi

source: LinkedIn URL
uz: LinkedIn havolasi

source: Year
uz: Yil

source: Institution
uz: Muassasa

source: User Course
uz: Foydalanuvchi kursi

source: User Courses
uz: Foydalanuvchi kurslari

source: Course Type
uz: Kurs turi

source: Tags
uz: Teglar

source: Price
uz: Narx

source: Main Course Image
uz: Kursning asosiy rasmi

source: Preview Image
uz: Ko‘rib chiqish rasmi

source: Is Preview
uz: Oldindan ko‘rish

source: Is Published
uz: E’lon qilingan

source: Overview
uz: Umumiy ma’lumot

source: Watched Seconds
uz: Ko‘rilgan soniyalar

source: Watched Percent
uz: Ko‘rilgan foiz

source: Last Updated
uz: Oxirgi yangilanish

source: Lecture Progress
uz: Ma’ruza jarayoni

source: Lecture Progresses
uz: Ma’ruzalar jarayoni

source: Video URL
uz: Video havolasi

source: Course Bullet Point
uz: Kurs bandi

source: Course Bullet Points
uz: Kurs bandlari

source: Comment
uz: Izoh

source: Show on site
uz: Saytda ko‘rsatish

source: Course Item
uz: Kurs elementi

source: Course Items
uz: Kurs elementlari

source: Quiz Attempt
uz: Testga urinish

source: Quiz Attempts
uz: Testga urinishlar

source: Quiz Progress
uz: Test jarayoni

source: Quiz Progresses
uz: Test jarayonlari

source: Section
uz: Bo‘lim

source: Content Type
uz: Kontent turi

source: Object ID
uz: Obyekt identifikatori

source: Multiple Choice
uz: Bir nechta javobli test

source: True/False
uz: To‘g‘ri/Yolg‘on

source: Radio
uz: Bitta javobli test

source: Question Text
uz: Savol matni

source: Question Type
uz: Savol turi

source: Updated At
uz: Yangilangan sana

source: Choice Text
uz: Tanlov matni

source: Is Correct
uz: To‘g‘ri javob

source: Score
uz: Ball

source: Completed Test
uz: Test yakunlangan

source: Started At
uz: Boshlangan sana

source: Finished At
uz: Tugagan sana

source: Chosen Option
uz: Tanlangan javob

source: User Answer
uz: Foydalanuvchi javobi

source: User Answers
uz: Foydalanuvchi javoblari
